Revit 2026 API

# FilteredWorksetIdIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual WorksetId Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As WorksetId
	Get
```
```cpp
public:
virtual property WorksetId^ Current {
	WorksetId^ get ();
}
```
```fsharp
abstract Current : WorksetId with get
override Current : WorksetId with get
```

#### Property Value

WorksetId

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

FilteredWorksetIdIterator Class

Autodesk.Revit.DB Namespace